
IF OBJECT_ID('tb_User') IS NOT NULL
DROP TABLE tb_User;
CREATE table tb_User
(
No
varchar(30) primary key not null,
Password VARBINARY(128) NOT NULL,
PassQuestion varchar(Max) null
);   --患者
INSERT tb_User
(No,Password,PassQuestion)
VALUES
('3210707035',HASHBYTES('MD5','7056'),'tgy，fhm');
IF OBJECT_ID('tb_campus') IS NOT NULL
DROP TABLE tb_campus;
CREATE TABLE tb_campus (
address
char(100)
not null
,idcampus
char(100)
 NOT NULL
PRIMARY KEY	
)--院区
INSERT tb_campus
(address,idcampus)
VALUES
('闽侯上街','001')
IF OBJECT_ID('tb_doctor') IS NOT NULL
DROP TABLE tb_doctor;
CREATE TABLE tb_doctor (
	 No
	 CHAR(6)
	 NOT NULL
	 PRIMARY KEY
	 ,Password
	 VARCHAR(20)
	 NOT NULL
	 ,Name
	 VARCHAR(20)
	 NOT NULL
	 ,Title
	 CHAR(20)
	 NOT NULL
	 ,Type
	 VARCHAR(10)
	 NOT NULL
)--医生
INSERT tb_doctor
(No,Password,Name,Title,Type) 
VALUES
('Y10001',HASHBYTES('MD5','1234'),'于刚','主任医生','眼科')
,('Y10002',HASHBYTES('MD5','1234'),'刘虎','主任医生','眼科')
,('Y10003',HASHBYTES('MD5','1234'),'曹文红','主任医生','眼科')
,('Y10004',HASHBYTES('MD5','1234'),'项道满','主任医生','眼科')
,('G10001',HASHBYTES('MD5','1234'),'姜亮','主任医生','骨科')
,('G10002',HASHBYTES('MD5','1234'),'曾意容','主任医生','骨科')
,('G10003',HASHBYTES('MD5','1234'),'赵黎','主任医生','骨科')
,('G10004',HASHBYTES('MD5','1234'),'李为','主任医生','骨科')
,('E10001',HASHBYTES('MD5','1234'),'赵海龙','主任医生','儿科')
,('E10002',HASHBYTES('MD5','1234'),'许鹏飞','主任医生','儿科')
,('E10003',HASHBYTES('MD5','1234'),'徐灵敏','主任医生','儿科')
,('E10004',HASHBYTES('MD5','1234'),'王玉霞','主任医生','儿科')
,('F10001',HASHBYTES('MD5','1234'),'孙即友','主任医生','妇科')
,('F10002',HASHBYTES('MD5','1234'),'曹大农','主任医生','妇科')
,('F10003',HASHBYTES('MD5','1234'),'吴鸣','主任医生','妇科')
,('F10004',HASHBYTES('MD5','1234'),'汪清','主任医生','妇科')
,('N10001',HASHBYTES('MD5','1234'),'李同源','主任医生','内科')
,('N10002',HASHBYTES('MD5','1234'),'郑东辉','主任医生','内科')
,('N10003',HASHBYTES('MD5','1234'),'姜玉武','主任医生','内科')
,('N10004',HASHBYTES('MD5','1234'),'吴永建','主任医生','内科')
,('K10001',HASHBYTES('MD5','1234'),'吕晓东','主任医生','口腔科')
,('K10002',HASHBYTES('MD5','1234'),'林小溪','主任医生','口腔科')
,('K10003',HASHBYTES('MD5','1234'),'曾琪','主任医生','口腔科')
,('K10004',HASHBYTES('MD5','1234'),'郭慧琴','主任医生','口腔科')
,('Q10001',HASHBYTES('MD5','1234'),'江平','主任医生','耳鼻喉科')
,('Q10002',HASHBYTES('MD5','1234'),'高静','主任医生','耳鼻喉科')
,('Q10003',HASHBYTES('MD5','1234'),'杨军','主任医生','耳鼻喉科')
,('Q10004',HASHBYTES('MD5','1234'),'向明亮','主任医生','耳鼻喉科')
,('W10001',HASHBYTES('MD5','1234'),'葛巾','主任医生','外科')
,('W10002',HASHBYTES('MD5','1234'),'孙克平','主任医生','外科')
,('W10003',HASHBYTES('MD5','1234'),'刘秋良','主任医生','外科')
,('W10004',HASHBYTES('MD5','1234'),'刘如恩','主任医生','外科')
,('P10001',HASHBYTES('MD5','1234'),'马东来','主任医生','皮肤科')
,('P10002',HASHBYTES('MD5','1234'),'刘学伟','主任医生','皮肤科')
,('P10003',HASHBYTES('MD5','1234'),'罗继虎','主任医生','皮肤科')
,('P10004',HASHBYTES('MD5','1234'),'黄青','主任医生','皮肤科')

IF OBJECT_ID('tb_depaterment') IS NOT NULL
DROP TABLE tb_depaterment;
CREATE TABLE tb_depaterment (
    IDDEPART
    CHAR(10) 
    NOT NULL
	CONSTRAINT IDDEPART
	PRIMARY KEY(IDDEPART)
	,Name
	char(10)
	Not Null
);--科室
INSERT tb_depaterment
(IDDEPART,Name)
VALUES
(001,'耳鼻喉科')
IF OBJECT_ID('tb_HospitalAccountRecord') IS NOT NULL
DROP TABLE tb_HospitalAccountRecord
CREATE TABLE tb_HospitalAccountRecord
(
    No
	INT IDENTITY(1,1)
	NOT NULL
	PRIMARY KEY
	,UserNo
	CHAR(10)
	NOT NULL
	,Money
	INT
	NOT NULL
	,Time
	DATETIME
	NOT NULL
	,Type
	VARCHAR(10)
	NOT NULL
	,Department
	VARCHAR(10)
	NOT NULL
)
IF OBJECT_ID('tb_AllPrescribe') IS NOT NULL

DROP TABLE tb_AllPrescribe
CREATE TABLE tb_AllPrescribe
(
    Name
	VARCHAR(100)
	NOT NULL
	,Count
	INT
	NOT NULL
	,Mark
	VARCHAR(8)
	NOT NULL
	,Type
	VARCHAR(10)
	NOT NULL
	,Date
	DATE
	NOT NULL
	,Time
	VARCHAR(20)
	NOT NULL
	,Price
	INT
	NOT NULL
	,PinYin
	VARCHAR(1000)
	NOT NULL
	,Operate1
	VARCHAR(4)
	NULL
	,Operate2
	VARCHAR(4)
	NULL
	PRIMARY KEY(Name,Date)
)
INSERT tb_AllPrescribe
(Name,Count,Mark,Type,Date,Time,Price,PinYin)
VALUES
('防风通圣丸',999,'颗','眼科','2022-1-1','6年',10,'fftsw')
,('牛黄解毒片',999,'片','眼科','2022-1-1','6年',11,'nhjdp')
,('黄连上清丸',999,'颗','眼科','2022-1-1','6年',12,'hlsqw')
,('补中益气丸',999,'颗','眼科','2022-1-1','6年',13,'bzyqw')
,('六味地黄丸',999,'颗','眼科','2022-1-1','6年',14,'lwdhw')
,('杞菊地黄丸',999,'颗','眼科','2022-1-1','6年',15,'qjdhw')
,('知柏地黄丸',999,'颗','眼科','2022-1-1','6年',16,'zbdhw')
,('石斛夜光丸',999,'颗','眼科','2022-1-1','6年',17,'shygw')
,('金匮益气丸',999,'颗','眼科','2022-1-1','6年',18,'jkyqw')
,('参三七片',999,'片','眼科','2022-1-1','6年',19,'csqp')
,('复方丹参片',999,'片','眼科','2022-1-1','6年',20,'ffdcp')
,('八宝眼药',999,'颗','眼科','2022-1-1','6年',21,'bbyy')
,('补益蒺藜丸',999,'颗','眼科','2022-1-1','6年',22,'byjlw')
,('复明片',999,'片','眼科','2022-1-1','6年',23,'fmp')
,('开光复明丸',999,'颗','眼科','2022-1-1','6年',24,'kgfmw')
,('琥珀还睛丸',999,'颗','眼科','2022-1-1','6年',25,'hphjw')
,('明目上清片',999,'片','眼科','2022-1-1','6年',26,'mmsqp')
,('障翳散',999,'颗','眼科','2022-1-1','6年',27,'zys')
,('拨云退翳丸',999,'颗','眼科','2022-1-1','6年',28,'bytyw')
,('明目地黄丸',999,'颗','眼科','2022-1-1','6年',29,'mmdhw')
,('疏散风热剂',999,'剂','儿科','2022-1-1','6年',30,'ssfrj')
,('发散风寒剂',999,'剂','儿科','2022-1-1','6年',31,'fsfhj')
,('清热解毒消肿剂',999,'剂','儿科','2022-1-1','6年',32,'qrjdxzj')
,('清利止泻剂',999,'剂','儿科','2022-1-1','6年',33,'qlzxj')
,('健脾止泻剂',999,'剂','儿科','2022-1-1','6年',34,'jpzxj')
,('消食导滞剂',999,'剂','儿科','2022-1-1','6年',35,'xsdzj')
,('健脾消食剂',999,'剂','儿科','2022-1-1','6年',36,'jpxsj')
,('清宣降气化痰剂',999,'剂','儿科','2022-1-1','6年',37,'qxjqhtj')
,('益气养阴剂',999,'剂','儿科','2022-1-1','6年',38,'yqyyj')
,('治急惊剂',999,'剂','儿科','2022-1-1','6年',39,'zjjj')
,('清热散风明目剂',999,'剂','儿科','2022-1-1','6年',40,'qrsfmmj')
,('清热滞火明目剂',999,'剂','儿科','2022-1-1','6年',41,'qrzhmmj')
,('滋阴养肝明目剂',999,'剂','儿科','2022-1-1','6年',42,'zyygmmj')
,('益气养阴化痰明目剂',999,'剂','儿科','2022-1-1','6年',43,'yqyyhtmmj')
,('清肝利耳剂',999,'剂','儿科','2022-1-1','6年',44,'qglej')
,('益肾聪耳剂',999,'剂','儿科','2022-1-1','6年',45,'yscej')
,('清宣通窍剂',999,'剂','儿科','2022-1-1','6年',46,'qxtqj')
,('清化通窍剂',999,'剂','儿科','2022-1-1','6年',47,'qhtqj')
,('散风通窍剂',999,'剂','儿科','2022-1-1','6年',48,'sftqj')
,('清解利咽剂',999,'剂','儿科','2022-1-1','6年',49,'qjlyj')
,('桂枝合剂',999,'剂','内科','2022-1-1','6年',50,'gzhj')
,('表实感冒颗粒',999,'颗','内科','2022-1-1','6年',51,'bsgmkl')
,('感冒清热颗粒',999,'颗','内科','2022-1-1','6年',52,'gmqrkl')
,('正柴胡饮颗粒',999,'颗','内科','2022-1-1','6年',53,'zchykl')
,('银翘解毒丸',999,'颗','内科','2022-1-1','6年',54,'yqjdw')
,('双黄连口服液',999,'口服液','内科','2022-1-1','6年',55,'shlkfy')
,('桑菊感冒片',999,'片','内科','2022-1-1','6年',56,'sjgmp')
,('羚羊感冒片',999,'片','内科','2022-1-1','6年',57,'lygmp')
,('连花清瘟胶囊',999,'胶囊','内科','2022-1-1','6年',58,'lhqwjn')
,('九味羌活丸',999,'颗','内科','2022-1-1','6年',59,'jwqhw')
,('荆防颗粒',999,'颗','内科','2022-1-1','6年',60,'jfkl')
,('午时茶颗粒',999,'颗','内科','2022-1-1','6年',61,'wsckl')
,('保济丸',999,'颗','内科','2022-1-1','6年',62,'bjw')
,('参苏丸',999,'颗','内科','2022-1-1','6年',63,'csw')
,('甘露消毒丸',999,'颗','内科','2022-1-1','6年',64,'glxdw')
,('六合定中丸',999,'颗','内科','2022-1-1','6年',65,'lhdzw')
,('葛根芩连丸',999,'颗','内科','2022-1-1','6年',66,'ggqlw')
,('双清口服液',999,'口服液','内科','2022-1-1','6年',67,'sqkfy')
,('九制大黄丸',999,'颗','内科','2022-1-1','6年',69,'jzdhw')
,('身痛逐淤汤',999,'剂','骨科','2022-1-1','6年',70,'stzyt')
,('参苓白术散',999,'剂','骨科','2022-1-1','6年',71,'clbss')
,('左归丸',999,'颗','骨科','2022-1-1','6年',72,'zgw')
,('右归丸',999,'颗','骨科','2022-1-1','6年',73,'ygw')
,('独活寄生汤',999,'剂','骨科','2022-1-1','6年',74,'dhjst')
,('四妙散',999,'剂','骨科','2022-1-1','6年',75,'sms')
,('十全大补汤',999,'剂','骨科','2022-1-1','6年',76,'sqdbt')
,('桃红四物汤',999,'剂','骨科','2022-1-1','6年',77,'thswt')
,('桃核承气汤',999,'剂','骨科','2022-1-1','6年',78,'thcqt')
,('血腑逐淤汤',999,'剂','骨科','2022-1-1','6年',79,'xfzyt')
,('补阳还五汤',999,'剂','骨科','2022-1-1','6年',80,'byhwt')
,('大承气汤',999,'剂','骨科','2022-1-1','6年',81,'dcqt')
,('羌活胜湿汤',999,'剂','骨科','2022-1-1','6年',82,'qhsst')
,('麻子仁丸',999,'颗','骨科','2022-1-1','6年',83,'mzrw')
,('补中益气汤',999,'剂','骨科','2022-1-1','6年',84,'bzyqt')
,('当归补血汤',999,'剂','骨科','2022-1-1','6年',85,'dgbxt')
,('麻黄汤',999,'剂','骨科','2022-1-1','6年',86,'mht')
,('银翘散',999,'剂','骨科','2022-1-1','6年',87,'yqs')
,('散菊饮',999,'剂','骨科','2022-1-1','6年',88,'sjy')
,('桂枝汤',999,'剂','骨科','2022-1-1','6年',89,'gzt')
,('二妙散',999,'剂','外科','2022-1-1','6年',90,'ems')
,('二陈汤',999,'剂','外科','2022-1-1','6年',91,'ect')
,('增液汤',999,'剂','外科','2022-1-1','6年',92,'zyt')
,('真武汤',999,'剂','外科','2022-1-1','6年',93,'zwt')
,('猪苓汤',999,'剂','外科','2022-1-1','6年',94,'zlt')
,('乌梅丸',999,'颗','外科','2022-1-1','6年',95,'wmw')
,('左金丸',999,'颗','外科','2022-1-1','6年',96,'zjw')
,('四逆散',999,'剂','外科','2022-1-1','6年',97,'sns')
,('生脉散',999,'剂','外科','2022-1-1','6年',98,'sms')
,('小柴胡汤',999,'剂','外科','2022-1-1','6年',99,'xcht')
,('五苓散',999,'剂','外科','2022-1-1','6年',100,'wls')
,('五味消毒饮',999,'剂','外科','2022-1-1','6年',101,'wwxdy')
,('一贯煎',999,'剂','外科','2022-1-1','6年',102,'ygj')
,('二至丸',999,'颗','外科','2022-1-1','6年',103,'ezw')
,('二仙汤',999,'剂','外科','2022-1-1','6年',104,'ext')
,('八珍汤',999,'剂','外科','2022-1-1','6年',105,'bzt')
,('八正散',999,'剂','外科','2022-1-1','6年',106,'bzs')
,('三妙丸',999,'颗','外科','2022-1-1','6年',107,'smw')
,('大补阴丸',999,'颗','外科','2022-1-1','6年',108,'dbyw')
,('大黄牡丹汤',999,'剂','外科','2022-1-1','6年',109,'dhmdt')
,('缩宫素',999,'片','妇产科','2022-1-1','6年',110,'sgs')
,('卡贝缩宫素',999,'片','妇产科','2022-1-1','6年',111,'kbsgs')
,('麦角新碱',999,'片','妇产科','2022-1-1','6年',112,'mjxj')
,('米非司酮',999,'片','妇产科','2022-1-1','6年',113,'mfst')
,('卡前列腺素氨丁三醇',999,'片','妇产科','2022-1-1','6年',114,'kqlxsadsc')
,('米索前列腺',999,'片','妇产科','2022-1-1','6年',115,'msqlx')
,('利托君',999,'片','妇产科','2022-1-1','6年',116,'ltj')
,('硫酸镁',999,'片','妇产科','2022-1-1','6年',117,'lsm')
,('逍遥丸',999,'颗','妇产科','2022-1-1','6年',118,'xyw')
,('妇科千金片',999,'片','妇产科','2022-1-1','6年',119,'fkqjp')
,('乌鸡白凤丸',999,'颗','妇产科','2022-1-1','6年',120,'wjbfw')
,('四物膏',999,'膏药','妇产科','2022-1-1','6年',121,'swg')
,('去氧孕烯炔雌醇片',999,'片','妇产科','2022-1-1','6年',122,'qyyxqccp')
,('地塞米松',999,'片','妇产科','2022-1-1','6年',123,'dsms')
,('甲基睾丸酮',999,'片','妇产科','2022-1-1','6年',124,'jjgwt')
,('黄体酮',999,'片','妇产科','2022-1-1','6年',125,'htt')
,('溴隐亭',999,'片','妇产科','2022-1-1','6年',126,'xyt')
,('维生素B6',999,'片','妇产科','2022-1-1','6年',127,'wssb6')
,('氨甲苯酸',999,'片','妇产科','2022-1-1','6年',128,'ajbs')
,('补佳乐',999,'片','妇产科','2022-1-1','6年',129,'bjl')
,('阿莫西林',999,'片','口腔科','2022-1-1','6年',130,'amxl')
,('头孢噻吩钠',999,'片','口腔科','2022-1-1','6年',131,'tbsfn')
,('头孢硫脒',999,'片','口腔科','2022-1-1','6年',132,'tblm')
,('阿奇霉素',999,'片','口腔科','2022-1-1','6年',133,'aqms')
,('庆大霉素',999,'片','口腔科','2022-1-1','6年',134,'qdms')
,('甲硝唑',999,'片','口腔科','2022-1-1','6年',135,'jxz')
,('替硝唑',999,'片','口腔科','2022-1-1','6年',136,'txz')
,('普鲁卡因',999,'注射','口腔科','2022-1-1','6年',137,'plky')
,('利多卡因',999,'注射','口腔科','2022-1-1','6年',138,'ldky')
,('布比卡因',999,'注射','口腔科','2022-1-1','6年',139,'bbky')
,('丁卡因',999,'注射','口腔科','2022-1-1','6年',140,'dky')
,('阿司匹林',999,'片','口腔科','2022-1-1','6年',141,'aspl')
,('布洛芬',999,'片','口腔科','2022-1-1','6年',142,'blf')
,('双氯芬酸钠',999,'片','口腔科','2022-1-1','6年',143,'slfsn')
,('苯妥英钠',999,'片','口腔科','2022-1-1','6年',144,'btyn')
,('维生素k',999,'片','口腔科','2022-1-1','6年',145,'wssk')
,('巴曲酶',999,'片','口腔科','2022-1-1','6年',146,'bqm')
,('苯酚',999,'片','口腔科','2022-1-1','6年',147,'bf')
,('碘伏',999,'片','口腔科','2022-1-1','6年',148,'df')
,('西瓜霜喷剂',999,'喷剂','口腔科','2022-1-1','6年',149,'xgspj')
,('阿昔洛韦片',999,'片','皮肤科','2022-1-1','6年',150,'axlwp')
,('阿昔洛韦乳膏',999,'膏药','皮肤科','2022-1-1','6年',151,'axlwrg')
,('阿昔洛韦注射剂',999,'注射','皮肤科','2022-1-1','6年',152,'axlwzsj')
,('地西泮片',999,'片','皮肤科','2022-1-1','6年',153,'dxpp')
,('大黄蛰虫丸',999,'颗','皮肤科','2022-1-1','6年',154,'dhzcw')
,('丁酸氢化可的松乳膏',999,'膏药','皮肤科','2022-1-1','6年',155,'dsqhkdsrg')
,('谷维素片',999,'片','皮肤科','2022-1-1','6年',156,'gwsp')
,('利巴韦林注射液',999,'注射','皮肤科','2022-1-1','6年',157,'lbwlzsy')
,('肝素钠乳膏',999,'膏药','皮肤科','2022-1-1','6年',158,'gsnrg')
,('甘草锌胶囊',999,'胶囊','皮肤科','2022-1-1','6年',159,'gcxjn')
,('罗红素酶片',999,'片','皮肤科','2022-1-1','6年',160,'lhsmp')
,('氯雷他定片',999,'片','皮肤科','2022-1-1','6年',161,'lltdp')
,('硫软膏',999,'膏药','皮肤科','2022-1-1','6年',162,'lrg')
,('四黄散',999,'片','皮肤科','2022-1-1','6年',163,'shs')
,('西地碘片',999,'片','皮肤科','2022-1-1','6年',164,'xddp')
,('鱼石脂软膏',999,'膏药','皮肤科','2022-1-1','6年',165,'yszrg')
,('制霉菌素片',999,'片','皮肤科','2022-1-1','6年',166,'zmjsp')
IF OBJECT_ID('tb_RefundInfo') IS NOT NULL
DROP TABLE tb_RefundInfo
CREATE TABLE tb_RefundInfo
(
    Name
	VARCHAR(100)
	NOT NULL
	,Count
	INT
	NOT NULL
	,Mark
	VARCHAR(8)
	NOT NULL
	,Type
	VARCHAR(10)
	NOT NULL
	,Date
	DATE
	NOT NULL
	,Price
	INT
	NOT NULL
	,Time
	DATE
	,Total
	INT
	PRIMARY KEY(Name,Date,Time,Count)
)
IF OBJECT_ID('tb_UserInfo') IS NOT NULL--用户信息
DROP TABLE tb_UserInfo      
CREATE TABLE tb_UserInfo
(   No
    CHAR(10)
	NOT NULL
	PRIMARY KEY, 
   IdCard
   CHAR(18)
   NOT NULL
   ,Phone
   CHAR(11)
   NOT NULL
   ,Name
   VARCHAR(20)
   NOT NULL
   ,Address
   VARCHAR(100)
   NOT NULL
)
IF OBJECT_ID('tb_Department') IS NOT NULL--科室
DROP TABLE tb_Department        
CREATE TABLE tb_Department
(
     No
	 VARCHAR(5)
	 NOT NULL
	 PRIMARY KEY
	 ,Name
	 VARCHAR(20)
	 NOT NULL
)
INSERT tb_Department   
(No,Name) VALUES
('1','眼科'),
('2','儿科'),
('3','骨科'),
('4','妇科'),
('5','内科'),
('6','外科'),
('7','口腔科'),
('8','皮肤科'),
('9','耳鼻喉科')

